УТ/src/InformationRegisters/АУ_УведомленияПоСобытиям/АУ_УведомленияПоСобытиям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АУ_УведомленияПоСобытиям</name>
  <resources>
    <name>Уведомление</name>
    <type>
      <types>CatalogRef.АУ_Уведомления</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникСсылка</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникНаборЗаписей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.АУ_ВидыСобытийОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/АУ_СпособыУведомлений/АУ_СпособыУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АУ_СпособыУведомлений</name>
  <enumValues>
    <name>Почта</name>
  </enumValues>
  <enumValues>
    <name>Телеграмм</name>
  </enumValues>
  <enumValues>
    <name>ЗадачаУТ</name>
  </enumValues>
  <enumValues>
    <name>НапоминаниеУТ</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/АУ_Уведомления/АУ_Уведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АУ_Уведомления</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидУведомления</name>
    <type>
      <types>EnumRef.АУ_ВидыУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Настройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаВыполнения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияОФайле</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СобытияОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСобытия</name>
      <type>
        <types>EnumRef.АУ_ВидыСобытийОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/CommonModules/АУ_Уведомления/Module.bsl
#Область ПрограммныйИнтерфейс

// Добавляет к отправке уведомление по объекту
//
// Параметры:
//  - Объект - документ, справочник или другой ссылочный объект, по котрому отправляется уведомление
//	- ВидСобытия - строка, идентификатор события по которому идет отправка
//	- Тема - строка, тема письма
//	- Тело - строка, тело письма
//	- Получатели - массив структур ("Адрес, Представление")
//
Процедура ОтправитьПочтовоеУведомление(Объект, ВидСобытия, Тема, Тело, Получатели, ПолучателиКопии = Неопределено, ПолучателиСкрытые = Неопределено, Вложения = Неопределено, ТипТекста = Неопределено, УчетнаяЗапись = Неопределено, ДатаУведомления = Неопределено, Уведомление = Неопределено, Единственное = Истина, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДатаФормирования = ТекущаяДатаСеанса();
	
	НаборЗаписей = РегистрыСведений.АУ_СформированныеУведомления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект, Истина);
	НаборЗаписей.Отбор.ВидСобытия.Установить(ВидСобытия, Истина);
	НаборЗаписей.Отбор.ДатаФормирования.Установить(ДатаФормирования, Истина);
	
	Запись = НаборЗаписей.Добавить();
	Запись.СпособУведомления = Перечисления.АУ_СпособыУведомлений.Почта;
	Запись.Объект = Объект;
	Запись.ВидСобытия = ВидСобытия;
	Запись.ДатаФормирования = ДатаФормирования;
	Запись.Тема = Тема;
	Запись.Тело = Тело;
	Запись.ТипТекста = ТипТекста;
	Запись.Получатели = ЗначениеВСтрокуВнутр(Получатели);
	Запись.ПолучателиКопии = ЗначениеВСтрокуВнутр(ПолучателиКопии);
	Запись.ПолучателиСкрытые = ЗначениеВСтрокуВнутр(ПолучателиСкрытые);
	Запись.Уведомление = Уведомление;
	Запись.ДатаУведомления = ДатаУведомления;
	Запись.ДополнительныеПараметры = ДополнительныеПараметры;
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	
	Если НЕ Единственное Тогда
		
		ИдентификаторУведомления = СокрЛП(Новый УникальныйИдентификатор);
		НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторУведомления, Истина);
		Запись.Идентификатор = ИдентификаторУведомления;
		
	КонецЕсли;
	
	МассивПредставлений = Новый Массив;
	Для каждого стрПолучатель Из Получатели Цикл
		МассивПредставлений.Добавить(СтрШаблон("%1 <%2>", стрПолучатель.Представление, стрПолучатель.Адрес));
	КонецЦикла;
	Запись.ПолучателиСтрокой = СтрСоединить(МассивПредставлений, ";");
	
	Если ЗначениеЗаполнено(ПолучателиКопии) Тогда
		
		МассивПредставлений = Новый Массив;
		Для каждого стрПолучатель Из ПолучателиКопии Цикл
			МассивПредставлений.Добавить(СтрШаблон("%1 <%2>", стрПолучатель.Представление, стрПолучатель.Адрес));
		КонецЦикла;
		Запись.ПолучателиКопииСтрокой = СтрСоединить(МассивПредставлений, ";");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолучателиСкрытые) Тогда
		
		МассивПредставлений = Новый Массив;
		Для каждого стрПолучатель Из ПолучателиСкрытые Цикл
			МассивПредставлений.Добавить(СтрШаблон("%1 <%2>", стрПолучатель.Представление, стрПолучатель.Адрес));
		КонецЦикла;
		Запись.ПолучателиСкрытыеСтрокой = СтрСоединить(МассивПредставлений, ";");
		
	КонецЕсли;
	
	Если НЕ Вложения = Неопределено Тогда
		
		МассивФайлов = Новый Массив;
		
		Для каждого стрВложение Из Вложения Цикл
			
			ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
			ПараметрыФайла.ВладелецФайлов = ПолучитьПапкуДляФайлов();
			ПараметрыФайла.ИмяБезРасширения = стрВложение.ИмяФайла;
			ПараметрыФайла.РасширениеБезТочки = стрВложение.РасширениеФайла;
			
			Файл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, стрВложение.Адрес);
			
			МассивФайлов.Добавить(Файл);
			
		КонецЦикла;
		
		Запись.Вложения = ЗначениеВСтрокуВнутр(МассивФайлов);
		
	КонецЕсли;
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ОтправитьУведомлениеНапоминанием(Объект, ВидСобытия, Тема, Тело, Получатели, ДатаУведомления = Неопределено, Уведомление = Неопределено, Единственное = Истина, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДатаФормирования = ТекущаяДатаСеанса();
	
	НаборЗаписей = РегистрыСведений.АУ_СформированныеУведомления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект, Истина);
	НаборЗаписей.Отбор.ВидСобытия.Установить(ВидСобытия, Истина);
	НаборЗаписей.Отбор.ДатаФормирования.Установить(ДатаФормирования, Истина);
	
	Запись = НаборЗаписей.Добавить();
	Запись.СпособУведомления = Перечисления.АУ_СпособыУведомлений.НапоминаниеУТ;
	Запись.Объект = Объект;
	Запись.ВидСобытия = ВидСобытия;
	Запись.ДатаФормирования = ДатаФормирования;
	Запись.Тема = Тема;
	Запись.Тело = Тело;
	Запись.Получатели = ЗначениеВСтрокуВнутр(Получатели);
	Запись.Уведомление = Уведомление;
	Запись.ДатаУведомления = ДатаУведомления;
	Запись.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если НЕ Единственное Тогда
		
		ИдентификаторУведомления = СокрЛП(Новый УникальныйИдентификатор);
		НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторУведомления, Истина);
		Запись.Идентификатор = ИдентификаторУведомления;
		
	КонецЕсли;
	
	МассивПредставлений = Новый Массив;
	Для каждого стрПолучатель Из Получатели Цикл
		МассивПредставлений.Добавить(СокрЛП(стрПолучатель));
	КонецЦикла;
	Запись.ПолучателиСтрокой = СтрСоединить(МассивПредставлений, ";");
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Возвращает информацию о последнем отправленном уведомлении
//
// Параметры:
//  - Объект - документ, справочник или другой ссылочный объект, по котрому было отправлено уведомление
//	- ВидСобытия - строка, идентификатор события по которому была отправка отправка
//
// Возвращаемое значение
//	- Структура
//
Функция ПолучитьИнформациюОПоследнемУведомлении(Объект, ВидСобытия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.АУ_СформированныеУведомления КАК АУ_СформированныеУведомления
	|ГДЕ
	|	АУ_СформированныеУведомления.Объект = &Объект
	|	И АУ_СформированныеУведомления.ВидСобытия = &ВидСобытия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаФормирования УБЫВ";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
	
	Результат = АУ_ОбщиеПроцедурыИФункцииСервер.СоздатьСтруктуруПоРегиструСведений("АУ_СформированныеУведомления");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьВложениеДляОтправкиУведомления(Данные, ИмяФайла, Расширение) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяФайла", ИмяФайла);
	Результат.Вставить("РасширениеФайла", Расширение);
	
	Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
		Результат.Вставить("Адрес", ПоместитьВоВременноеХранилище(Данные));
	Иначе
		Результат.Вставить("Адрес", Данные);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьМассивАдресовПолучателейПоМассивуПользователей(МассивПользователей) Экспорт
	
	АдресаПолучателей = Новый Массив;
		
	Для каждого Пользователь Из МассивПользователей Цикл
		
		АдресПочты = АУ_ОбщиеПроцедурыИФункцииСервер.ПолучитьEmailОбъекта(Пользователь);
		Если ЗначениеЗаполнено(АдресПочты) Тогда
			АдресаПолучателей.Добавить(Новый Структура("Адрес,Представление", АдресПочты, СокрЛП(Пользователь)));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат АдресаПолучателей;
	
КонецФункции

#КонецОбласти

#Область РегламентныеЗадания

// Отправляет неоправленные ранее уведомления
//
// Параметры:
//  Нет
//
Процедура ОтправкаУведомлений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.АУ_СформированныеУведомления КАК АУ_СформированныеУведомления
	|ГДЕ
	|	НЕ АУ_СформированныеУведомления.Отправлено
	|	И АУ_СформированныеУведомления.КоличествоПопыток <= &КоличествоПопыток
	|	И АУ_СформированныеУведомления.ДатаУведомления <= &ДатаУведомления";
	
	Запрос.УстановитьПараметр("ДатаУведомления", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("КоличествоПопыток", АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("КоличествоПопытокОтправкиУведомлений"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СпособУведомления = Перечисления.АУ_СпособыУведомлений.Почта Тогда
			
			Получатели = ЗначениеИзСтрокиВнутр(Выборка.Получатели);
			ПолучателиКопии = ЗначениеИзСтрокиВнутр(Выборка.ПолучателиКопии);
			ПолучателиСкрытые = ЗначениеИзСтрокиВнутр(Выборка.ПолучателиСкрытые);
			
			ПараметрыПисьма = Новый Структура;
			ПараметрыПисьма.Вставить("Кому", Получатели);
			ПараметрыПисьма.Вставить("Копии", ПолучателиКопии);
			ПараметрыПисьма.Вставить("СкрытыеКопии", ПолучателиСкрытые);
			ПараметрыПисьма.Вставить("ПолучателиСообщения", Получатели);
			ПараметрыПисьма.Вставить("Тема", Выборка.Тема);
			ПараметрыПисьма.Вставить("Тело", Выборка.Тело);
			ПараметрыПисьма.Вставить("ТипТекста", ?(ЗначениеЗаполнено(Выборка.ТипТекста), 
													Выборка.ТипТекста, 
													Неопределено));
			
			Если ЗначениеЗаполнено(Выборка.Вложения) Тогда
				
				ПараметрыПисьма.Вставить("Вложения", Новый Массив);
				Вложения = ЗначениеИзСтрокиВнутр(Выборка.Вложения);
				
				Для каждого стрФайл Из Вложения Цикл
					
					ДанныеФайла = Новый Структура;
					ДанныеФайла.Вставить("Представление", СокрЛП(стрФайл));
					ДанныеФайла.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(РаботаСФайлами.ДвоичныеДанныеФайла(стрФайл)));
					
					ПараметрыПисьма.Вложения.Добавить(ДанныеФайла);
					
				КонецЦикла;
				
			КонецЕсли;
			
			Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыПисьма);
			
			Попытка
				
				Если НЕ ЗначениеЗаполнено(Выборка.УчетнаяЗапись) Тогда
					УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
				Иначе
					УчетнаяЗапись = Выборка.УчетнаяЗапись;
				КонецЕсли;
				
				РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗапись, Письмо);
				
				ДатаОтправки = ТекущаяДатаСеанса();
		
				НаборЗаписей = РегистрыСведений.АУ_СформированныеУведомления.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект, Истина);
				НаборЗаписей.Отбор.ВидСобытия.Установить(Выборка.ВидСобытия, Истина);
				НаборЗаписей.Отбор.ДатаФормирования.Установить(Выборка.ДатаФормирования, Истина);
				НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор, Истина);
				
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				
				Запись.Отправлено = Истина;
				Запись.ДатаОтправки = ДатаОтправки;
				Запись.УчетнаяЗапись = УчетнаяЗапись;
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				
			Исключение
				
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
				НаборЗаписей = РегистрыСведений.АУ_СформированныеУведомления.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект, Истина);
				НаборЗаписей.Отбор.ВидСобытия.Установить(Выборка.ВидСобытия, Истина);
				НаборЗаписей.Отбор.ДатаФормирования.Установить(Выборка.ДатаФормирования, Истина);
				НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор, Истина);
				
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				
				Запись.Ошибка = Истина;
				Запись.ТекстОшибки = ТекстОшибки;
				Запись.КоличествоПопыток = Запись.КоличествоПопыток + 1;
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				
				ЗаписьЖурналаРегистрации("АУ_Уведомления.ОтправкаУведомленийПоПочте", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
				
			КонецПопытки;
			
		ИначеЕсли Выборка.СпособУведомления = Перечисления.АУ_СпособыУведомлений.НапоминаниеУТ Тогда
			
			Получатели = ЗначениеИзСтрокиВнутр(Выборка.Получатели);
			
			Для каждого стрПолучатель Из Получатели Цикл
				
				ВремяСобытия = ТекущаяДатаСеанса();
				
				НаборЗаписей = РегистрыСведений.НапоминанияПользователя.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Пользователь.Установить(стрПолучатель, Истина);
				НаборЗаписей.Отбор.ВремяСобытия.Установить(ВремяСобытия, Истина);
				НаборЗаписей.Отбор.Источник.Установить(Выборка.Объект, Истина);
				
				Запись = НаборЗаписей.Добавить();
				Запись.Пользователь = стрПолучатель;
				Запись.ВремяСобытия = ВремяСобытия;
				Запись.Источник = Выборка.Объект;
				Запись.СрокНапоминания = ?(ЗначениеЗаполнено(Выборка.ДатаУведомления), Выборка.ДатаУведомления, ВремяСобытия);
				Запись.Описание = Выборка.Тело;
				Запись.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
			НаборЗаписей = РегистрыСведений.АУ_СформированныеУведомления.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект, Истина);
			НаборЗаписей.Отбор.ВидСобытия.Установить(Выборка.ВидСобытия, Истина);
			НаборЗаписей.Отбор.ДатаФормирования.Установить(Выборка.ДатаФормирования, Истина);
			НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор, Истина);
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Запись.Отправлено = Истина;
			Запись.ДатаОтправки = ТекущаяДатаСеанса();
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать(Истина);
			
		Иначе
			
			НаборЗаписей = РегистрыСведений.АУ_СформированныеУведомления.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект, Истина);
			НаборЗаписей.Отбор.ВидСобытия.Установить(Выборка.ВидСобытия, Истина);
			НаборЗаписей.Отбор.ДатаФормирования.Установить(Выборка.ДатаФормирования, Истина);
			НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор, Истина);
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Запись.Отправлено = Истина;
			Запись.ДатаОтправки = ТекущаяДатаСеанса();
			Запись.ТекстОшибки = "Неизвестный способ уведомления";
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ФормированиеУведомлений(Уведомление, ФормироватьВсегда = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Уведомление) ИЛИ НЕ ТипЗнч(Уведомление) = Тип("СправочникСсылка.АУ_Уведомления") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление, "Использование") И НЕ ФормироватьВсегда Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаВыполнения = ОбъектОбработкиВыполнения(Уведомление);
	ОбработкаВыполнения.СформироватьУведомления(Уведомление);
	
КонецПроцедуры

Процедура ФормированиеУведомленийПоСобытиям() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АУ_УведомленияПоСобытиям.Идентификатор КАК Идентификатор,
	|	АУ_УведомленияПоСобытиям.Уведомление КАК Уведомление,
	|	АУ_УведомленияПоСобытиям.ИсточникСсылка КАК ИсточникСсылка,
	|	АУ_УведомленияПоСобытиям.ИсточникНаборЗаписей КАК ИсточникНаборЗаписей,
	|	АУ_УведомленияПоСобытиям.ВидСобытия КАК ВидСобытия
	|ИЗ
	|	РегистрСведений.АУ_УведомленияПоСобытиям КАК АУ_УведомленияПоСобытиям";
	
	НаборЗаписей = РегистрыСведений.АУ_УведомленияПоСобытиям.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбработкаВыполнения = ОбъектОбработкиВыполнения(Выборка.Уведомление);
		
		ИсточникСобытия = Неопределено;
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор, Истина);
		
		Попытка
			
			Если ЗначениеЗаполнено(Выборка.ИсточникСсылка) Тогда
				ИсточникСобытия = Выборка.ИсточникСсылка;
			Иначе
				ИсточникСобытия = ЗначениеИзСтрокиВнутр(Выборка.ИсточникНаборЗаписей);
			КонецЕсли;
			
			ОбработкаВыполнения.СформироватьУведомления(Выборка.Уведомление, ИсточникСобытия, Выборка.ВидСобытия);
			
		Исключение
			
			ТекстОшибки = ОписаниеОшибки();
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Ошибка = Истина;
			Запись.ТекстОшибки = ТекстОшибки;
			
			ЗаписьЖурналаРегистрации("АУ_Уведомления.ФормированиеУведомленийПоСобытиям", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			
		КонецПопытки;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСправочникомАУ_Уведомления

// Подключает и возвращает имя, под которым подключен внешний отчет или обработка.
// После подключения отчет или обработка регистрируется в программе под определенным именем,
// используя которое, можно создавать объект или открывать формы отчета или обработки.
//
// Параметры:
//   Ссылка - СправочникСсылка.АУ_Уведомления - подключаемая обработка.
//
// Возвращаемое значение: 
//   Строка       - имя подключенного отчета или обработки.
//   Неопределено - если передана некорректная ссылка.
//
Функция ПодключитьОбработкуВыполнения(Ссылка) Экспорт
	
	Результат = Неопределено;
	
	// Проверка корректности переданных параметров.
	Если ТипЗнч(Ссылка) <> Тип("СправочникСсылка.АУ_Уведомления") 
		Или Ссылка = Справочники.АУ_Уведомления.ПустаяСсылка() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапуска = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ОбработкаВыполнения");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПараметрыЗапуска.ОбработкаВыполнения.Получить());
	
	ИмяОбработки = ВнешниеОбработки.Подключить(АдресВоВременномХранилище, , Ложь,
		ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
	Возврат ИмяОбработки;
	
КонецФункции

// Возвращает объект внешнего отчета или обработки.
//
// Параметры:
//   Ссылка - СправочникСсылка.АУ_Уведомления - подключаемый отчет или обработка.
//
// Возвращаемое значение: 
//   ВнешняяОбработка - объект подключенной обработки.
//   Неопределено     - если передана некорректная ссылка.
//
Функция ОбъектОбработкиВыполнения(Ссылка) Экспорт
	
	Результат = Неопределено;
	
	// Подключение
	ИмяОбработки = ПодключитьОбработкуВыполнения(Ссылка);
	
	// Проверка корректности переданных параметров.
	Если ИмяОбработки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ВнешниеОбработки.Создать(ИмяОбработки);
	
КонецФункции

Функция ПолучитьНастройкиОбработкиВыполнения(Уведомление) Экспорт
	
	СохраненныеНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление, "Настройки");
	Возврат СохраненныеНастройки.Получить();
	
КонецФункции

#КонецОбласти

#Область ПодпискиНаСобытия

Процедура СформироватьУведомленияПоСобытию(Источник, ВидСобытия, ЭтоРегистр = Ложь)
	
	ПолноеИмя = Источник.Метаданные().ПолноеИмя();
	Если ПолноеИмя = "Справочник.ВерсииРасширений" Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмя = Источник.Метаданные().ПолноеИмя();
	Если ПолноеИмя = "Справочник.ИдентификаторыОбъектовМетаданных" Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмя = Источник.Метаданные().ПолноеИмя();
	Если ПолноеИмя = "Справочник.ИдентификаторыОбъектовРасширений" Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмя = Источник.Метаданные().ПолноеИмя();
	Если ПолноеИмя = "РегистрСведений.ИдентификаторыОбъектовВерсийРасширений" Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмя = Источник.Метаданные().ПолноеИмя();
	Если ПолноеИмя = "РегистрСведений.ПараметрыРаботыПрограммы" Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмя = Источник.Метаданные().ПолноеИмя();
	Если ПолноеИмя = "РегистрСведений.ПараметрыРаботыВерсийРасширений" Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Источник.Метаданные());
	МассивУведомлений = ПолучитьУведомленияПоСобытию(ИдентификаторМетаданных, ВидСобытия);
	
	ИсточникНаборЗаписей = Неопределено;
	ИсточникСсылка = Неопределено;
	
	Если ЭтоРегистр Тогда
		ИсточникНаборЗаписей = ЗначениеВСтрокуВнутр(Источник.Выгрузить());
	Иначе
		ИсточникСсылка = Источник.Ссылка;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.АУ_УведомленияПоСобытиям.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	Для каждого Уведомление Из МассивУведомлений Цикл
	
		НаборЗаписей.Очистить();
		ИДЗаписи = СокрЛП(Новый УникальныйИдентификатор);
		НаборЗаписей.Отбор.Идентификатор.Установить(ИДЗаписи, Истина);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Идентификатор = ИДЗаписи;
		Запись.Уведомление = Уведомление;
		Запись.ИсточникСсылка = ИсточникСсылка;
		Запись.ИсточникНаборЗаписей = ИсточникНаборЗаписей;
		Запись.ВидСобытия = ВидСобытия;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УведомленияПриЗаписиСсылочногоОбъектаПриЗаписи(Источник, Отказ) Экспорт
	
	СформироватьУведомленияПоСобытию(Источник, Перечисления.АУ_ВидыСобытийОбъектов.ЗаписьОбъекта);
	
КонецПроцедуры

Процедура УведомленияПриЗаписиРегистраПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	СформироватьУведомленияПоСобытию(Источник, Перечисления.АУ_ВидыСобытийОбъектов.ЗаписьОбъекта, Истина);
	
КонецПроцедуры

Процедура УведомленияПриПроведенииДокументаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	СформироватьУведомленияПоСобытию(Источник, Перечисления.АУ_ВидыСобытийОбъектов.ПроведениеДокумента);
	
КонецПроцедуры

Процедура УведомленияПриОтменеПроведенияДокументаОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	СформироватьУведомленияПоСобытию(Источник, Перечисления.АУ_ВидыСобытийОбъектов.ОтменаПроведения);
	
КонецПроцедуры

Процедура УведомленияПриУстановкиПометкиУдаленияПередУдалением(Источник, Отказ) Экспорт
	
	СформироватьУведомленияПоСобытию(Источник, Перечисления.АУ_ВидыСобытийОбъектов.УдалениеОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Функция ПолучитьУведомленияПоСобытию(ИдентификаторМетаданных, ВидСобытия)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АУ_УведомленияСобытияОбъектов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.АУ_Уведомления.СобытияОбъектов КАК АУ_УведомленияСобытияОбъектов
	|ГДЕ
	|	АУ_УведомленияСобытияОбъектов.Объект = &Объект
	|	И АУ_УведомленияСобытияОбъектов.ВидСобытия = &ВидСобытия
	|	И АУ_УведомленияСобытияОбъектов.Ссылка.Использование";
	
	Запрос.УстановитьПараметр("Объект", ИдентификаторМетаданных);
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьПапкуДляФайлов()
	
	Возврат АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("ПапкаФайловВложенийУведомлений");
	
КонецФункции

#КонецОбласти
